#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```
module.keycloak_dev.module.onestopauth.module.client_test-08-09-2021-199.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=923bb5f0-6d5b-4be4-864c-8abe19e58ece]
module.keycloak_dev.module.onestopauth.module.client_aug-31-424-pm-1323.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=3bbf1856-ce26-4a86-87a2-8e83330980f3]
module.keycloak_dev.module.onestopauth.module.client_test-08-09-2021-199.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=a3080342-cba8-493a-8c3a-198a6a586c55]
module.keycloak_dev.module.onestopauth.module.client_test-08-09-2021-199.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=e2ffe2c8-b585-44a4-a875-bbcb78d492bf]
module.keycloak_dev.module.onestopauth.module.client_test-08-09-2021-199.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=bd8c6ab7-d79f-4554-a338-24e81dc53946]
module.keycloak_dev.module.onestopauth.module.client_test-08-09-2021-199.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=eceb3f1d-925d-46b6-8fd1-2ba30696184f]
module.keycloak_dev.module.onestopauth.module.client_test-08-09-2021-199.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=4a6406b5-4e77-491b-ab48-0839fb65c44a]
module.keycloak_dev.module.onestopauth_both.module.client_test-2774.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=735ef5cc-f171-4b01-9154-9a58908f2713]
module.keycloak_dev.module.onestopauth_both.module.client_test-2774.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=d2abfa5d-7227-45c4-9007-6168a20c2236]
module.keycloak_dev.module.onestopauth_both.module.client_test-2774.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=15b25011-e2f9-4624-aa95-ec31762efd41]
module.keycloak_dev.module.onestopauth_both.module.client_test-2774.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=aaec779c-3997-4bd1-9110-053ac3562a1e]
module.keycloak_dev.module.onestopauth_both.module.client_test-2774.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=5c549940-4259-483d-9e8c-58798d94783d]
module.keycloak_dev.module.onestopauth.module.client_test-7-28-2021-133.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=9324b99a-fbf3-473d-b34d-e56d786848aa]
module.keycloak_dev.module.onestopauth.module.client_email-test-2146.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=7dcb4a6c-74f1-4fd5-90ce-9cd04ebaa823]
module.keycloak_dev.module.onestopauth_both.module.client_test-2774.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=23bf5767-8186-4afc-83c8-c07b3ee1f5f9]
module.keycloak_dev.module.onestopauth.module.client_email-test-2146.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=d188a175-64ad-46f2-b475-d94ffa8214e6]
module.keycloak_dev.module.onestopauth.module.client_email-test-2146.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=5a1faafd-d237-4e1a-8c8f-9c84543c7a05]
module.keycloak_dev.module.onestopauth.module.client_email-test-2146.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=43b348e7-1155-4c6d-a095-8c8f3169acae]
module.keycloak_dev.module.onestopauth.module.client_email-test-2146.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=c40b6620-e9fb-4746-8a22-04d984a39a9e]
module.keycloak_dev.module.onestopauth.module.client_email-test-2146.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=48c22371-0b6b-4313-9dc5-a9af981bb9a3]
module.keycloak_dev.module.onestopauth.module.client_email-test-2146.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=d0377886-284b-4711-b6a8-676032c32f4a]
module.keycloak_dev.module.onestopauth_both.module.client_test-2774.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=dd1e36d8-5e78-4051-a411-74aecb4521a4]
module.keycloak_dev.module.onestopauth.module.client_test-project-1-663.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=414580c7-4ea8-43cd-882c-265ea6f990b9]
module.keycloak_dev.module.onestopauth.module.client_test-project-1-663.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=7bf5a529-7614-49cf-a235-48d7974fe5e2]
module.keycloak_dev.module.onestopauth.module.client_test-project-1-663.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=b9309558-1291-44fe-a0e4-d78aeb6c25c9]
module.keycloak_dev.module.onestopauth.module.client_test-project-1-663.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=04a6414c-2513-4833-9d08-c25c662c9daa]
module.keycloak_dev.module.onestopauth.module.client_test-project-1-663.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=ec5bb8e0-d9d2-4016-b07d-efaa920b9b0c]
module.keycloak_dev.module.onestopauth.module.client_test-project-1-663.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=0589962d-173d-4770-a497-cdb72c488266]
module.keycloak_dev.module.onestopauth.module.client_newkeycloakdeploy-2311.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=f137a67a-d37e-4cfb-80c7-7cebbee7dda8]
module.keycloak_dev.module.onestopauth.module.client_newkeycloakdeploy-2311.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=ce3053ff-d553-4b63-bfd1-3b82f87f977c]
module.keycloak_dev.module.onestopauth.module.client_test-project-1-663.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=9ddcb15e-e415-4fdd-9288-d8c8f090fa8a]
module.keycloak_dev.module.onestopauth.module.client_newkeycloakdeploy-2311.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=dba26b00-e3d2-42d6-a77b-3ca68d240f8c]
module.keycloak_dev.module.onestopauth.module.client_test-7-28-2021-133.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=3928016b-9993-4ae4-8f5a-f2c988710f6b]
module.keycloak_dev.module.onestopauth.module.client_newkeycloakdeploy-2311.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=5e3683e2-7310-407f-91f6-3a64297dc90b]
module.keycloak_dev.module.onestopauth.module.client_newkeycloakdeploy-2311.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=60b4e3b4-5913-431f-bb01-bd94f9822d6f]
module.keycloak_dev.module.onestopauth.module.client_newkeycloakdeploy-2311.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=a8528ccb-998e-4ca8-923b-ff4b66258cab]
module.keycloak_dev.module.onestopauth.module.client_newkeycloakdeploy-2311.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=59886227-c5cc-4819-b346-ff3853c8d3f4]
module.keycloak_dev.module.onestopauth.module.client_test-7-28-2021-133.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=edb9b7eb-a870-42b6-8fcb-ce214e846d92]
module.keycloak_dev.module.onestopauth.module.client_test-7-28-2021-133.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=5f2e7cb5-4203-45e8-97bf-26e62a071753]
module.keycloak_dev.module.onestopauth.module.client_test-7-28-2021-133.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=ea90df44-6f29-4da4-b3f0-b7cf51b2f87d]
module.keycloak_dev.module.onestopauth.module.client_test-7-28-2021-133.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=2b0a92d5-c80d-405d-806d-395d38edf809]
module.keycloak_dev.module.onestopauth.module.client_ztest-134.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=6adff7c6-2b56-4487-81fe-9f971a811395]
module.keycloak_dev.module.onestopauth.module.client_test-7-28-2021-133.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=157c5fc1-4957-4134-855a-e94e8d60f2d8]
module.keycloak_dev.module.onestopauth.module.client_ztest-134.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=e0ddcb68-4096-42e1-8fd5-2518504141ff]
module.keycloak_dev.module.onestopauth.module.client_ztest-134.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=faf1f28b-4112-4dd2-9a26-c3cbc14a9e4e]
module.keycloak_dev.module.onestopauth.module.client_ztest-134.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=2a8ea77a-cf20-4da2-9409-ab12f7aad71a]
module.keycloak_dev.module.onestopauth.module.client_ztest-134.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=85265bc8-746c-4278-b1d3-4dfcc44269e3]
module.keycloak_dev.module.onestopauth.module.client_aet-2-1982.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=f7ca60c1-3f0c-4075-b616-17301a7e7dd0]
module.keycloak_dev.module.onestopauth.module.client_ztest-134.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=0a73c6f7-0a33-4775-899a-9d0976d05b83]
module.keycloak_dev.module.onestopauth.module.client_ztest-134.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=5462e686-cd42-4b34-9856-162b6d45c728]
module.keycloak_dev.module.onestopauth.module.client_aet-2-1982.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=6bd563e9-25bd-43a1-a70f-ca62f6c34d5e]
module.keycloak_dev.module.onestopauth.module.client_aet-2-1982.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=a876afbb-854b-4fb8-b10c-1cbd6f52babd]
module.keycloak_dev.module.onestopauth.module.client_aet-2-1982.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=dc10e7b0-46a1-463c-8bb8-0de6e11797c1]
module.keycloak_dev.module.onestopauth.module.client_aet-2-1982.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=9f81a09c-904f-408d-b31b-fcce498b1c68]
module.keycloak_dev.module.onestopauth.module.client_aet-2-1982.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=7b72c55a-1f74-43ba-b93c-01da06606349]
module.keycloak_dev.module.onestopauth.module.client_junmin-request-34.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=31ce7dc9-f930-421f-a93e-86a0c0ead613]
module.keycloak_dev.module.onestopauth.module.client_junmin-request-34.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=afeb995f-a519-4f19-a10b-cde7e1a40803]
module.keycloak_dev.module.onestopauth.module.client_junmin-request-34.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=89161301-45c5-4d41-860a-7315549335a8]
module.keycloak_dev.module.onestopauth.module.client_aet-2-1982.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=9a7cb46f-4b62-4e58-8d2b-aba44d07e1f3]
module.keycloak_dev.module.onestopauth.module.client_junmin-request-34.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=d00fe817-e89f-43b8-aeaa-4b3379ac0b29]
module.keycloak_dev.module.onestopauth.module.client_junmin-request-34.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=c6ffacca-6e07-465c-a0f0-fca71212fb2b]
module.keycloak_dev.module.onestopauth.module.client_junmin-request-34.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=a5ceda21-fbcc-40e0-ab5d-97a08df2305f]
module.keycloak_dev.module.onestopauth.module.client_junmin-request-34.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=140e35d9-4536-472a-a440-2abdd0822d11]
module.keycloak_dev.module.onestopauth.module.client_asdfsafa-1322.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=5d755043-106c-4be5-a4a1-8f0c08813461]
module.keycloak_dev.module.onestopauth.module.client_asdfsafa-1322.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=1dd7cbe2-be93-49fe-8fec-b8c1c496d1eb]
module.keycloak_dev.module.onestopauth.module.client_asdfsafa-1322.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=4f505a0b-c7e8-4d1d-9125-d7c38f13e6ea]
module.keycloak_dev.module.onestopauth.module.client_asdfsafa-1322.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=7b99a1f1-daeb-4321-ae19-68a7c9163a2e]
module.keycloak_dev.module.onestopauth.module.client_asdfsafa-1322.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=ba6b53a8-14d2-477b-a14b-86b8cade2108]
module.keycloak_dev.module.onestopauth.module.client_asdfsafa-1322.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=e1a321a0-44fc-4e27-a627-d09bccba5cd5]
module.keycloak_dev.module.onestopauth.module.client_asdfsafa-1322.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=76709862-4fec-47a7-9a1c-66dfdb0dd267]
module.keycloak_dev.module.onestopauth.module.client_testclient-10.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=4f8be9c3-6b41-4bfd-8c22-203391a135d5]
module.keycloak_dev.module.onestopauth.module.client_testclient-10.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=203caf5b-7262-4a5e-95e1-2016477c08ce]
module.keycloak_dev.module.onestopauth.module.client_testclient-10.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=7af5bb55-d337-43fe-b601-35dfceb6b9ce]
module.keycloak_dev.module.onestopauth.module.client_testclient-10.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=5ea88be0-05eb-4cb4-b2d5-611e99f35b30]
module.keycloak_dev.module.onestopauth.module.client_testclient-10.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=fdd1b368-149a-4755-899c-397f192c302d]
module.keycloak_dev.module.onestopauth.module.client_test-859.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=68ed2201-cb2c-48be-8bc9-c0937693dc0c]
module.keycloak_dev.module.onestopauth.module.client_testclient-10.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=b3a2ad3e-de7d-4181-bfd5-3f883f0f7620]
module.keycloak_dev.module.onestopauth.module.client_test-859.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=ec9c89b1-a50c-4436-93ce-2a9269a8d727]
module.keycloak_dev.module.onestopauth.module.client_testclient-10.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=bde3707f-383d-4d20-a79d-e4c4f7931b1f]
module.keycloak_dev.module.onestopauth.module.client_august-19-741-pm-694.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=14a63c25-5444-4943-8bfa-53520c4e2861]
module.keycloak_dev.module.onestopauth.module.client_test-859.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=4ca2dc6b-a930-48c3-8c6f-e93edc3bbbb6]
module.keycloak_dev.module.onestopauth.module.client_test-859.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=5f21918d-989f-43d5-b5b7-19b02854476a]
module.keycloak_dev.module.onestopauth.module.client_august-19-741-pm-694.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=88561a69-cd7d-4381-a942-2422f0d02936]
module.keycloak_dev.module.onestopauth.module.client_august-19-741-pm-694.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=f8ee461d-80a8-4027-a8dd-07573e4d4b35]
module.keycloak_dev.module.onestopauth.module.client_august-19-741-pm-694.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=583325d5-1108-4dc3-a278-a11dfb024c27]
module.keycloak_dev.module.onestopauth.module.client_test-859.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=5a2e3188-50f1-40b6-b758-7f623344fd9b]
module.keycloak_dev.module.onestopauth.module.client_august-19-741-pm-694.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=bc7f6a47-0e3a-4f2f-9921-1d908e2277c2]
module.keycloak_dev.module.onestopauth.module.client_test-859.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=8c801a7a-fbf6-4127-a5b3-1f89f5b26c05]
module.keycloak_dev.module.onestopauth.module.client_august-19-741-pm-694.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=54e80cc7-ebf7-48b0-880e-efa628c7ee70]
module.keycloak_dev.module.onestopauth.module.client_test-859.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=d4f514b1-c336-4b87-b52f-a6332cc9fe55]
module.keycloak_dev.module.onestopauth.module.client_august-19-741-pm-694.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=b379ada4-dfdd-42f4-818c-2ec3a92ad4a0]
module.keycloak_dev.module.onestopauth.module.client_6-test-for-release-v-1-70.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=a987e1ba-feca-44b9-8921-7cd7e1874e4d]
module.keycloak_dev.module.onestopauth.module.client_6-test-for-release-v-1-70.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=1c78179e-2ab9-45e2-8334-5aa3c09aee32]
module.keycloak_dev.module.onestopauth.module.client_6-test-for-release-v-1-70.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=8b1c0470-0d5a-47e9-ae2b-e7fbe31853ea]
module.keycloak_dev.module.onestopauth.module.client_6-test-for-release-v-1-70.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=5c6a2c53-bc74-4f6b-a273-7b7ea8edc89f]
module.keycloak_dev.module.onestopauth.module.client_6-test-for-release-v-1-70.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=9000ea25-1b5c-4f18-a84e-137b04b66ce7]
module.keycloak_dev.module.onestopauth.module.client_test-3-1552.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=af655271-36d3-4952-b9c0-97e5718062b2]
module.keycloak_dev.module.onestopauth.module.client_test-3-1552.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=99e2ea22-a390-4c6a-925f-208ae157d307]
module.keycloak_dev.module.onestopauth.module.client_test-3-1552.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=6b67ec10-ac9c-469b-96aa-3b1627801392]
module.keycloak_dev.module.onestopauth.module.client_test-3-1552.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=f23a948f-80a7-410b-9ea5-130b4f8d5227]
module.keycloak_dev.module.onestopauth.module.client_test-3-1552.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=35d4ccad-a338-4415-92dd-b674492f7064]
module.keycloak_dev.module.onestopauth.module.client_test-3-1552.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=a42c1d94-9fcb-4b93-9a88-676a1a70b3f3]
module.keycloak_dev.module.onestopauth.module.client_test-3-1552.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=29cf4f38-7e15-4d60-98b1-15ef1797548a]
module.keycloak_dev.module.onestopauth.module.client_6-test-for-release-v-1-70.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=2fdc614f-f1c7-46ee-9ce6-b4ee67d2453c]
module.keycloak_dev.module.onestopauth.module.client_6-test-for-release-v-1-70.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=cf707929-8c9a-43b7-bf96-bbe5c31de2d2]
module.keycloak_dev.module.onestopauth.module.client_test-69.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=656ea0c6-04d0-4953-a670-9482828b9b56]
module.keycloak_dev.module.onestopauth.module.client_test-69.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=b7c4055c-8f66-459f-94e4-cf51b597c772]
module.keycloak_dev.module.onestopauth.module.client_test-69.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=7f36873e-e532-4665-adfb-e67bef1bdfdd]
module.keycloak_dev.module.onestopauth.module.client_test-69.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=c0d6e389-c17c-4c6d-b1a2-4cf9d6049c6a]
module.keycloak_dev.module.onestopauth.module.client_test-69.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=d5471293-c661-4e0b-a6f7-5520712c4392]
module.keycloak_dev.module.onestopauth.module.client_jon-test-2-265.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=5c0dc433-cdee-409a-a664-454333d15633]
module.keycloak_dev.module.onestopauth.module.client_test-69.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=a486276e-2359-42aa-b7f5-624e9bbdaaac]
module.keycloak_dev.module.onestopauth.module.client_test-69.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=242f559a-5b9f-4351-abda-4aa1cd1ea96f]
module.keycloak_dev.module.onestopauth.module.client_mytestclientaaaa-135.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=fa0b6916-1bab-4a15-915b-c4374fb4ce91]
module.keycloak_dev.module.onestopauth.module.client_jon-test-2-265.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=8ff6a0fe-9347-4bf4-813b-6f589390e6c0]
module.keycloak_dev.module.onestopauth.module.client_mytestclientaaaa-135.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=17a09474-dbcb-4bf6-9b37-82d8afd0d7d3]
module.keycloak_dev.module.onestopauth.module.client_jon-test-2-265.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=5776640a-5533-45d8-854a-261a866a39f6]
module.keycloak_dev.module.onestopauth.module.client_mytestclientaaaa-135.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=9b1151fa-e4d2-4619-919f-e1e2723d077f]
module.keycloak_dev.module.onestopauth.module.client_mytestclientaaaa-135.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=31a1cdaa-a51f-43dc-85cf-4c846931ce29]
module.keycloak_dev.module.onestopauth.module.client_jon-test-2-265.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=0158e912-ee0b-4c71-9e93-f311c88e0e18]
module.keycloak_dev.module.onestopauth.module.client_mytestclientaaaa-135.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=39470b38-aaa9-48e5-a6e6-4f66302fcad1]
module.keycloak_dev.module.onestopauth.module.client_jon-test-2-265.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=6c7e0646-6f2a-4eb3-a7f4-31b0c340fe41]
module.keycloak_dev.module.onestopauth.module.client_mytestclientaaaa-135.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=b8206f35-b055-4fba-ad25-1b128bf2f2dd]
module.keycloak_dev.module.onestopauth.module.client_mytestclientaaaa-135.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=7039c887-d63a-4a76-be19-3f1a676bfc4e]
module.keycloak_dev.module.onestopauth.module.client_jon-test-2-265.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=54ef8733-7d92-4861-856a-a09e62ba595e]
module.keycloak_dev.module.onestopauth.module.client_jon-test-2-265.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=1171f0c5-d99a-433f-8e06-aa9755dcbbea]
module.keycloak_dev.module.onestopauth.module.client_https-bcgov-github-io-sso-terraform-dev-requestd-1521.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=cf9573a2-c57f-45e0-a3fc-57d8550ef3d2]
module.keycloak_dev.module.onestopauth.module.client_https-bcgov-github-io-sso-terraform-dev-requestd-1521.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=82106d8a-a91e-4d60-9704-53b3fb54e214]
module.keycloak_dev.module.onestopauth.module.client_https-bcgov-github-io-sso-terraform-dev-requestd-1521.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=2e62bc1f-6ddb-4b80-87e6-2681927bca93]
module.keycloak_dev.module.onestopauth.module.client_https-bcgov-github-io-sso-terraform-dev-requestd-1521.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=0ff51c39-4330-4c11-90ff-7829fd948015]
module.keycloak_dev.module.onestopauth.module.client_https-bcgov-github-io-sso-terraform-dev-requestd-1521.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=512c1cce-8b3c-4adc-88ba-d18d55398163]
module.keycloak_dev.module.onestopauth.module.client_https-bcgov-github-io-sso-terraform-dev-requestd-1521.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=228000d0-3e9f-4d89-bfe6-32768754a956]
module.keycloak_dev.module.onestopauth.module.client_https-bcgov-github-io-sso-terraform-dev-requestd-1521.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=abee11b5-692a-4b5f-9873-571fcec4f923]
module.keycloak_dev.module.onestopauth.module.client_negajjangproject-1.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=8a5a4f76-baac-470c-b6b1-824a1eaefc71]
module.keycloak_dev.module.onestopauth.module.client_negajjangproject-1.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=e75aabd1-6c1b-446f-95b2-31310949e683]
module.keycloak_dev.module.onestopauth.module.client_negajjangproject-1.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=cbd5024f-0f67-4742-9455-22d089eb0ed3]
module.keycloak_dev.module.onestopauth.module.client_negajjangproject-1.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=8d9393f7-1358-471a-9f84-224a92b8f4c4]
module.keycloak_dev.module.onestopauth.module.client_negajjangproject-1.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=746702ff-4ae3-491f-8c36-e65545ae0c4a]
module.keycloak_dev.module.onestopauth.module.client_negajjangproject-1.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=80b5b6f2-f4e0-4941-8699-07e4ac093347]
module.keycloak_dev.module.onestopauth.module.client_negajjangproject-1.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=531e17a2-e21e-4c06-a2de-bdb6e99146ce]
module.keycloak_dev.module.onestopauth.module.client_test-133.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=dd36d381-6a5d-412b-a12b-dd73179b04fd]
module.keycloak_dev.module.onestopauth.module.client_test-133.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=528d5877-0f65-4c0b-b8ac-e1804173c17e]
module.keycloak_dev.module.onestopauth.module.client_test-133.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=b93e77b5-a0ea-452c-aedc-0f4b9bf7248c]
module.keycloak_dev.module.onestopauth.module.client_test-133.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=74794491-d3b7-481d-b43d-3b99aee5bdc3]
module.keycloak_dev.module.onestopauth.module.client_test-133.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=63796d0a-9ded-41e6-bc15-9ff924002a17]
module.keycloak_dev.module.onestopauth.module.client_test-133.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=5bb291bf-32cf-4d7d-8816-3671f64d3098]
module.keycloak_dev.module.onestopauth.module.client_test-133.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=c0af637c-5098-4266-888c-15a73bc4a29e]
module.keycloak_dev.module.onestopauth.module.client_test-project.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=20a4cfb6-fa46-4a45-9584-94f739081562]
module.keycloak_dev.module.onestopauth.module.client_test-project.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=999a3d77-f13d-4107-9463-4b46ebb59f9e]
module.keycloak_dev.module.onestopauth.module.client_test-project.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=769933f1-95b5-4269-a036-65cf70088dd6]
module.keycloak_dev.module.onestopauth.module.client_test-project.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=280978b1-8a5a-495b-8f0d-d8a27a407a9c]
module.keycloak_dev.module.onestopauth.module.client_test-project.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=ea5a3565-a604-4c49-804e-27334f74b008]
module.keycloak_dev.module.onestopauth.module.client_test-project.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=0f19e326-fae3-4c20-9c15-44e06c42eaf8]
module.keycloak_dev.module.onestopauth.module.client_test-project.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=200dfacd-1822-4dc8-8ca1-eec450aa00b0]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.keycloak_dev.module.onestopauth_basic.module.client_bceid-prod-3203.keycloak_generic_client_protocol_mapper.access_token_aud will be created
  + resource "keycloak_generic_client_protocol_mapper" "access_token_aud" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"       = "true"
          + "id.token.claim"           = "false"
          + "included.client.audience" = "bceid-prod-3203"
        }
      + id              = (known after apply)
      + name            = "access_token_aud"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-audience-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_bceid-prod-3203.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_bceid-prod-3203.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_bceid-prod-3203.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_bceid-prod-3203.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "bceid-prod-3203"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_bceid-prod-3203.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_bceid-prod-3203.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_bceid-prod-3203.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "PUBLIC"
      + client_id                                = "bceid-prod-3203"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + description                              = "CSS App Created"
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = false
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "bceid-prod-3203"
      + pkce_code_challenge_method               = "S256"
      + realm_id                                 = "onestopauth-basic"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "http://a",
        ]
      + web_origins                              = [
          + "+",
        ]
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_bceid-prod-3203.keycloak_generic_client_protocol_mapper.access_token_aud will be created
  + resource "keycloak_generic_client_protocol_mapper" "access_token_aud" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"       = "true"
          + "id.token.claim"           = "false"
          + "included.client.audience" = "bceid-prod-3203"
        }
      + id              = (known after apply)
      + name            = "access_token_aud"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-audience-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_bceid-prod-3203.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_bceid-prod-3203.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_bceid-prod-3203.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_bceid-prod-3203.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "bceid-prod-3203"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_bceid-prod-3203.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_bceid-prod-3203.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_bceid-prod-3203.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "PUBLIC"
      + client_id                                = "bceid-prod-3203"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + description                              = "CSS App Created"
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = false
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "bceid-prod-3203"
      + pkce_code_challenge_method               = "S256"
      + realm_id                                 = "onestopauth-basic"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "http://b",
        ]
      + web_origins                              = [
          + "+",
        ]
    }

Plan: 16 to add, 0 to change, 0 to destroy.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_env" but a value
│ was found in file "/terraform/terraform.tfvars". If you meant to use this
│ value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_aws_account_id"
│ but a value was found in file "/terraform/terraform.tfvars". If you meant
│ to use this value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

------------------------------------------------------------------------

Cost estimation:

Waiting for cost estimate to complete...

Cost estimation:

Resources: 0 of 2968 estimated
           $0.0/mo +$0.0
```

</details>

*Pusher: @junmin-bcgov, Action: `pull_request`*